app/views/posts/show.html.erb

                          <div id="<%=@post.id%>">
                          <%if Like.where(user:current_user, post:@post).count>0%>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."user_id" = 1 AND "likes"."post_id" = 5